use ConstructionPlanningDb
go 

insert into ResourceTypes(Name, Description) values
	('Материальный', 'Включает материалы, изделия, конструкции'),
	('Технический', 'Включает машины, оборудование, транспортные средства'),
	('Природные', 'Включает минеральное сырье, водные и энергетические ресурсы')
go

insert into Resources(Name, TypeId, AvaliableAmount, UnitCost) values
	('Кирпич', 1, 1000, 100),
	('Бетонные блоки', 1, 500, 300),
	('Бревна', 1, 700, 200),
	('Автобетоновоз', 2, 5, 10000),
	('Автосамосвал', 2, 3, 9000),
	('Автоцементовоз', 2, 4, 9500),
	('Гранит', 3, 500, 200),
	('Песок ', 3, 700, 300),
	('Древесина', 3, 600, 250)

go

insert into Providers(Name, Address, Phone) values
	('Лучший поставщик', 'Адрес лучшего поставщика', '123456789'),
	('Хороший поставщик', 'Адрес хорошего поставщика', '987654321'),
	('Нормальный поставщик', 'Адрес нормального поставщика', '123498765')

go

insert into Sales(Date, ResourceId, Customer, Count) values
	('2022-04-01', 1, 'Первый покупатель', 100),
	('2022-04-01', 4, 'Второй покупатель', 1),
	('2022-04-02', 8, 'Первый покупатель', 100)

go

insert into Deliveries(ResourceId, ProviderId, Date, UnitCost, Count) values
	(2, 1, '2022-04-01', 100, 10),
	(5, 2, '2022-04-02', 10000, 1),
	(7, 3, '2022-04-03', 300, 10)
go

INSERT INTO [dbo].[Customers]
           ([Name]
           ,[Description]
           ,[Phone])
     VALUES
           ('Первый заказчик'
           ,'Описание первого заказчика'
           ,'123456789'),

		   ('Второй заказчик'
           ,'Описание второго заказчика'
           ,'123456789'),

		   ('Третий заказчик'
           ,'Описание третего заказчика'
           ,'123456789')
GO

INSERT INTO [dbo].[Projects]
           ([Name]
		   ,[DateOfCreate]
           ,[Deadline]
           ,[AllocatedAmount]
           ,[CustomerId])
     VALUES
           ('Жилой дом'
		   ,'2022-05-01T00:00:00'
           ,'2022-05-28T00:00:00'
           ,10000
           ,1),

		   ('Детский сад'
		   ,'2022-05-01T00:00:00'
           ,'2022-05-29T00:00:00'
           ,20000
           ,2),

		   ('Магазин'
		   ,'2022-05-01T00:00:00'
           ,'2022-05-30T00:00:00'
           ,25000
           ,2),
		   
		   ('Школа'
		   ,'2022-05-01T00:00:00'
           ,'2022-05-31T00:00:00'
           ,30000
           ,3)
GO

INSERT INTO [dbo].[ConstructionObjects]
           ([Name]
           ,[Description]
           ,[ProjectId])
     VALUES
           ('Объект1'
           ,'Описание объекта1'
           ,1),

		   ('Объект2'
           ,'Описание объекта2'
           ,1),

		   ('Объект1'
           ,'Описание объекта1'
           ,2),

		   ('Объект2'
           ,'Описание объекта2'
           ,2),
		   
		   ('Объект3'
           ,'Описание объекта3'
           ,2)
GO

INSERT INTO [dbo].[ResourcesPerObject]
           ([ConstructionObjectId]
           ,[ResourceId]
           ,[Count])
     VALUES
           (1
           ,1
           ,100),
		   
           (1
           ,2
           ,50),

		   (2
           ,2
           ,100),
		   
           (2
           ,3
           ,50),
		   
		   (3
           ,3
           ,100),
		   
           (3
           ,4
           ,50)
GO
